In [17]:
from selenium import webdriver
from selenium.webdriver.support.ui import WebDriverWait
from selenium.webdriver.support import expected_conditions as EC
from selenium.webdriver.common.by import By
from selenium.webdriver.common.keys import Keys
import pyautogui
import time
import os
import shutil
from selenium.webdriver.chrome.options import Options
import pandas as pd

In [18]:
driver = webdriver.Chrome(executable_path=r'C:\Users\sarav\Desktop\xyz88-master\chromedriver.exe')

In [19]:
driver.get('https://eclaim3.emcsthai.com/esurvey/frmLogin.aspx')
driver.maximize_window()
dcwh = driver.current_window_handle
driver.find_element_by_id('txtUserName').send_keys('noppadol@se.co.th')
driver.find_element_by_id('txtPassWord').send_keys('Somboonkul1501*')
driver.find_element_by_id('imbLogin').click()
driver.find_element_by_id('btnEnter').click()

In [20]:
allhandle_windows = driver.window_handles
for handle in allhandle_windows:
    if handle != dcwh:
        driver.switch_to_window(dcwh)

C:\Users\sarav\AppData\Local\Temp/ipykernel_6972/3003755061.py:4: DeprecationWarning: use driver.switch_to.window instead
  driver.switch_to_window(dcwh)

In [21]:
time.sleep(2)
driver.find_element_by_id('dgvInbox_ctl03_sname').click()

In [34]:
all_data = []
all_data = driver.find_elements_by_xpath('//*[@id="dgvList"]/tbody/tr')

In [23]:
data = []
for count, value in enumerate(all_data):
    if count > 0 and count < 16:
        data.append(value.text)
        data_frame = pd.DataFrame(data)
        data_frame.columns = ['Table']

        df_splite = data_frame.Table.str.extract('(\d\d)(\D{6})(\d{4})(\s)(\d\d\W\d\d)(\s)(\D\d{11})')
        df_splite.columns = ['Day', 'Month', 'Year','blank1', 'Time', 'blank2', 'Claim']
        df_s = df_splite.drop(columns=['blank1', 'blank2'])

        d = df_s['Day'].values
        m = df_s['Month'].values
        t = df_s['Time'].values
        y = df_s['Year'].values
        c = df_s['Claim'].values

        d_list = list(df_s['Day'].values)
        m_list = list(df_s['Month'].values)
        t_list = list(df_s['Time'].values)
        y_list = list(df_s['Year'].values)
        c_list = list(df_s['Claim'].values)

In [35]:
data = []
for count, value in enumerate(all_data):
    data.append(value.text)
    data_frame = pd.DataFrame(data)
    data_frame.columns = ['Table']

    df_splite = data_frame.Table.str.extract('(\d\d)(\D{6})(\d{4})(\s)(\d\d\W\d\d)(\s)(\D\d{11})')
    df_splite.columns = ['Day', 'Month', 'Year','blank1', 'Time', 'blank2', 'Claim']
    df_s = df_splite.drop(columns=['blank1', 'blank2'])

    d = df_s['Day'].values
    m = df_s['Month'].values
    t = df_s['Time'].values
    y = df_s['Year'].values
    c = df_s['Claim'].values

    d_list = list(df_s['Day'].values)
    m_list = list(df_s['Month'].values)
    t_list = list(df_s['Time'].values)
    y_list = list(df_s['Year'].values)
    c_list = list(df_s['Claim'].values)

In [36]:
df_s

    Day   Month  Year   Time         Claim
0   NaN     NaN   NaN    NaN           NaN
1    19  /ต.ค./  2564  20:26  S68421102591
2    19  /ต.ค./  2564  20:21  S68421102592
3    19  /ต.ค./  2564  20:17  S68421102577
4    19  /ต.ค./  2564  18:06  S68421081070
5    19  /ต.ค./  2564  16:42  S68421102564
6    19  /ต.ค./  2564  16:20  S68421102328
7    19  /ต.ค./  2564  16:16  S68421101949
8    19  /ต.ค./  2564  16:13  S68421102301
9    19  /ต.ค./  2564  15:58  S68421102015
10   19  /ต.ค./  2564  15:46  S68421102013
11   19  /ต.ค./  2564  15:25  S68421102012
12   19  /ต.ค./  2564  15:22  S68421102011
13   19  /ต.ค./  2564  15:16  S68421102009
14   19  /ต.ค./  2564  15:11  S68421102008
15   19  /ต.ค./  2564  14:56  S68421102007
16  NaN     NaN   NaN    NaN           NaN

In [37]:
df_s.loc[1:15]

   Day   Month  Year   Time         Claim
1   19  /ต.ค./  2564  20:26  S68421102591
2   19  /ต.ค./  2564  20:21  S68421102592
3   19  /ต.ค./  2564  20:17  S68421102577
4   19  /ต.ค./  2564  18:06  S68421081070
5   19  /ต.ค./  2564  16:42  S68421102564
6   19  /ต.ค./  2564  16:20  S68421102328
7   19  /ต.ค./  2564  16:16  S68421101949
8   19  /ต.ค./  2564  16:13  S68421102301
9   19  /ต.ค./  2564  15:58  S68421102015
10  19  /ต.ค./  2564  15:46  S68421102013
11  19  /ต.ค./  2564  15:25  S68421102012
12  19  /ต.ค./  2564  15:22  S68421102011
13  19  /ต.ค./  2564  15:16  S68421102009
14  19  /ต.ค./  2564  15:11  S68421102008
15  19  /ต.ค./  2564  14:56  S68421102007

In [43]:
day = '04'
month = '/ก.ย./'
year = '2564'

In [37]:
for cc,vv in enumerate(d_list):
    if day == vv  and month == :
        print('=')

=
=
=
=
=
=
=
=
=
=
=
=
=
=
=

In [51]:
df_s.Day == day

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
Name: Day, dtype: bool

In [1]:
import pandas as pd

In [2]:
items = [10,20,30,40]

In [3]:
ps = pd.Series(items)

In [4]:
ps

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
idex = [100,200,300,400]

In [6]:
ps=pd.Series(items,index=idex)

In [7]:
ps

100    10
200    20
300    30
400    40
dtype: int64

In [12]:
sr = {"mango":"มะม่วง","coconut":"มะพร้าว"}

In [13]:
ps=pd.Series(sr)

In [14]:
ps

mango       มะม่วง
coconut    มะพร้าว
dtype: object

In [15]:
items[2]

30

In [16]:
items[2:]

[30, 40]

In [38]:
datas = [10,20,30,40,50]

In [47]:
cols = ['อายุ']
ps = pd.DataFrame(datas,columns=cols)

In [48]:
ps

   อายุ
0    10
1    20
2    30
3    40
4    50

In [50]:
datas = [['keyboard','It',4000],['baby','toy','500'],['mouse','It','300']]

In [51]:
ps = pd.DataFrame(datas)

In [52]:
ps

          0    1     2
0  keyboard   It  4000
1      baby  toy   500
2     mouse   It   300

In [57]:
cols =['Name','Catagory','Price']

In [58]:
ps= pd.DataFrame(datas,columns=cols)

In [59]:
ps

       Name Catagory Price
0  keyboard       It  4000
1      baby      toy   500
2     mouse       It   300

In [76]:
name = ['keybord','baby','mouse']
category = ['it','toy','it']
price = [3,33,333]

datas = list(zip(name,category,price))

In [77]:
datas

[('keybord', 'it', 3), ('baby', 'toy', 33), ('mouse', 'it', 333)]

In [78]:
pd.DataFrame(datas,columns=cols)

      Name Catagory  Price
0  keybord       it      3
1     baby      toy     33
2    mouse       it    333

In [79]:
product = [
    {'Name':'คีย์บอร์ด','Category':'อุปกรณ์คอม','Price':'500'},
    {'Name':'เมาส์','Category':'อุปกรณ์คอม','Price':'300'},
    {'Name':'ตุ๊กตา','Category':'ของเล่น','Price':'900'}
    ]

In [82]:
ps = pd.DataFrame(product ,columns=cols)

In [83]:
ps

        Name  Catagory Price
0  คีย์บอร์ด       NaN   500
1      เมาส์       NaN   300
2     ตุ๊กตา       NaN   900

In [86]:
ps.set_index(['Name'],inplace=True)

In [89]:
ps

           Catagory Price
Name
คีย์บอร์ด       NaN   500
เมาส์           NaN   300
ตุ๊กตา          NaN   900

In [90]:
name = ['คีย์บอร์ด','เมาส์','ตุ๊กตา']
category = ['อุปกรณ์คอม','อุปกรณ์คอม','ของเล่น']
price = [500,300,900]

In [92]:
name_series = pd.Series(name)
category_series = pd.Series(category)
price_series = pd.Series(price)

In [94]:
frame = {'ชื่อสินค้า':name_series,'หมวดสินค้า':category_series,'ราคา':price_series}

In [97]:
ps = pd.DataFrame(frame)

In [100]:
ps

  ชื่อสินค้า  หมวดสินค้า  ราคา
0  คีย์บอร์ด  อุปกรณ์คอม   500
1      เมาส์  อุปกรณ์คอม   300
2     ตุ๊กตา     ของเล่น   900

In [101]:
ps.set_index(['ชื่อสินค้า'],inplace=True)

In [102]:
ps

            หมวดสินค้า  ราคา
ชื่อสินค้า
คีย์บอร์ด   อุปกรณ์คอม   500
เมาส์       อุปกรณ์คอม   300
ตุ๊กตา         ของเล่น   900